Revit 2027 API
AnalyticalElement.IsValidStructuralRole Method
 Checks whether the value set for Analytical Structural Role is valid for an Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidStructuralRole(
	AnalyticalStructuralRole structuralRole
)
Public Function IsValidStructuralRole (
	structuralRole As AnalyticalStructuralRole
) As Boolean
public:
bool IsValidStructuralRole(
	AnalyticalStructuralRole structuralRole
)
member IsValidStructuralRole :
        structuralRole : AnalyticalStructuralRole -> bool
Parameters
structuralRole AnalyticalStructuralRole
 The value set to be verified.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace